def tr(n):
    # Копируем число N для преобразования в троичную запись
    x = n
    # Инициализируем пустую строку для троичной записи
    s = ""
    # Пока число не уменьшится до 0
    while x > 0:
        # Добавляем остаток от деления на 3 слева к строке
        s = str(x % 3) + s
        # Делим число на 3 без остатка для следующей итерации
        x = x // 3
    # Возвращаем полученную троичную запись
    return s

# Инициализируем переменную для хранения минимального
# подходящего числа очень большим значением
mn = 10**10

# Перебираем числа от 1 до 99 включительно
for n in range(1, 100):
    # Получаем троичную запись числа N
    t = tr(n)
    # Подсчитываем сумму количества цифр ’1’ и ’2’ в записи
    s = sum(int(x) for x in t)
    c = t.count('1') + t.count('2')
    print(s, c, t)
    if (s) % 2 == 0:
        # Если сумма чётна, дописываем ’0’
        t += '0'
    else:
        # Иначе дописываем ’1’
        t += '1'
    # Повторяем подсчёт суммы для новой записи с добавленным символом
    s = sum(int(x) for x in t)
    c = t.count('1') + t.count('2')
    print(s, c)
    if (s) % 2 == 0:
        # Если сумма чётна, дописываем ’0’
        t += '0'
    else:
        # Иначе дописываем ’1’
        t += '1'
    # Переводим полученную троичную запись в десятичное число
    if int(t, 3) > 337:
        # Обновляем минимальное подходящее число
        mn = min(mn, int(t, 3))



# Выводим минимальное число R, большее 337
print(mn)
