count = 0
# for n in range(1_100_000_000, 1_987_653_210+1):
#     if n % 8 in [0, 3] or n % 16 in [10, 15]:
#         count += 1
# print(count)


# 20 -> 10100 -> 1010000 -> 1_010_000
# 21 -> 10101 -> 1010101 -> 1_010_101
# 22 -> 10110 -> 1011010 -> 1_011_010
# 23 -> 10111 -> 1011111 -> 1_011_111

print(1_011_010 % 8, 22 % 8)
print(1_010_101 % 8, 21 % 8)
print(1_010_000 % 8, 20 % 8)
print(1_011_111 % 8, 23 % 8)


332869954


# / 4
# 0 1 2 3
# 0 -> 0 -> 00
# 1 -> 1 -> 11
# 10 -> 10 -> 1010
# 11 -> 11 -> 1111



def solve_final():
    L, R = 1100000000, 1987653210
    result = 0

    # Случай 1: N = 4k, R = 8k
    # L <= 8k <= R
    k_min = (L + 7) // 8
    k_max = R // 8
    result += max(0, k_max - k_min + 1)

    # Случай 1: N = 4k+1, R = 8k+3
    # L <= 8k+3 <= R
    k_min = (L - 3 + 7) // 8
    k_max = (R - 3) // 8
    result += max(0, k_max - k_min + 1)

    # Случай 2: N = 4k+2, R = 16k+10
    # L <= 16k+10 <= R
    k_min = (L - 10 + 15) // 16
    k_max = (R - 10) // 16
    result += max(0, k_max - k_min + 1)

    # Случай 2: N = 4k+3, R = 16k+15
    # L <= 16k+15 <= R
    k_min = (L - 15 + 15) // 16
    k_max = (R - 15) // 16
    result += max(0, k_max - k_min + 1)

    return result

print(solve_final())
