def G(n):  # объявляем функцию G(n)
    if n < 2:  # базовый случай
        return 1

    # рекурсивный случай, сюда попадём при n > 1
    return F(n - 1) + 2 * G(n - 1)


def F(n):  # объявляем функцию F(n)
    if n < 2:  # базовый случай
        return 1

    if n % 2 == 1 and n > 1:  # рекурсивный случай для нечётного n > 1
        return F(n - 1) + G(n - 1)

    # рекурсивный случай, сюда попадём при чётном n > 1
    return F(n - 2) + G(n - 2)


# считаем и выводим значение выражения
print(F(25) - G(25))
